; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	thermograph2 - mode
	infrared1 - mode
	image0 - mode
	GroundStation1 - direction
	Star8 - direction
	GroundStation0 - direction
	GroundStation9 - direction
	GroundStation6 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation2 - direction
	Star7 - direction
	GroundStation3 - direction
	Star10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Planet13 - direction
	Star14 - direction
	Star15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 image0)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 GroundStation6)
	(supports instrument2 infrared1)
	(supports instrument2 image0)
	(supports instrument2 thermograph2)
	(calibration_target instrument2 GroundStation0)
	(calibration_target instrument2 Star8)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star14)
	(supports instrument3 image0)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation2)
	(calibration_target instrument3 GroundStation0)
	(calibration_target instrument3 GroundStation4)
	(supports instrument4 infrared1)
	(supports instrument4 thermograph2)
	(calibration_target instrument4 GroundStation4)
	(calibration_target instrument4 GroundStation9)
	(supports instrument5 image0)
	(supports instrument5 infrared1)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 GroundStation6)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star7)
	(supports instrument6 image0)
	(supports instrument6 thermograph2)
	(supports instrument6 infrared1)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 GroundStation4)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
	(supports instrument7 infrared1)
	(calibration_target instrument7 Star7)
	(supports instrument8 infrared1)
	(supports instrument8 image0)
	(supports instrument8 thermograph2)
	(calibration_target instrument8 GroundStation3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star8)
)
(:goal (and
	(pointing satellite1 Phenomenon11)
	(pointing satellite2 Star14)
	(pointing satellite3 Star15)
	(have_image Star10 image0)
	(have_image Phenomenon11 thermograph2)
	(have_image Planet12 image0)
	(have_image Planet13 image0)
	(have_image Star14 infrared1)
	(have_image Star15 image0)
	(have_image Phenomenon16 thermograph2)
))

)

; plan
1. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 0 of 10
2. (calibrate satellite2 instrument6 star5)
   added: (calibrated instrument6)
   goals met: 0 of 10
3. (turn_to satellite2 planet13 star5)
   deleted: (pointing satellite2 star5)
   added: (pointing satellite2 planet13)
   goals met: 0 of 10
4. (take_image satellite2 planet13 instrument6 image0)
   added: (have_image planet13 image0)
   goals met: 1 of 10
5. (turn_to satellite2 planet12 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 planet12)
   goals met: 1 of 10
6. (take_image satellite2 planet12 instrument6 image0)
   added: (have_image planet12 image0)
   goals met: 2 of 10
7. (turn_to satellite2 phenomenon16 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 phenomenon16)
   goals met: 2 of 10
8. (take_image satellite2 phenomenon16 instrument6 thermograph2)
   added: (have_image phenomenon16 thermograph2)
   goals met: 3 of 10
9. (turn_to satellite2 phenomenon11 phenomenon16)
   deleted: (pointing satellite2 phenomenon16)
   added: (pointing satellite2 phenomenon11)
   goals met: 3 of 10
10. (turn_to satellite1 phenomenon11 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 phenomenon11)
   goals met: 4 of 10
11. (take_image satellite2 phenomenon11 instrument6 thermograph2)
   added: (have_image phenomenon11 thermograph2)
   goals met: 5 of 10
12. (turn_to satellite2 star10 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 star10)
   goals met: 5 of 10
13. (take_image satellite2 star10 instrument6 image0)
   added: (have_image star10 image0)
   goals met: 6 of 10
14. (turn_to satellite2 star15 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star15)
   goals met: 6 of 10
15. (take_image satellite2 star15 instrument6 image0)
   added: (have_image star15 image0)
   goals met: 7 of 10
16. (turn_to satellite2 star14 star15)
   deleted: (pointing satellite2 star15)
   added: (pointing satellite2 star14)
   goals met: 8 of 10
17. (take_image satellite2 star14 instrument6 infrared1)
   added: (have_image star14 infrared1)
   goals met: 9 of 10
18. (turn_to satellite3 star15 star8)
   deleted: (pointing satellite3 star8)
   added: (pointing satellite3 star15)
   goals met: 10 of 10
